<a href="https://colab.research.google.com/github/medinadiegoeverardo/DS-Unit-1-Sprint-1-Dealing-With-Data/blob/master/module3-databackedassertions/medinadiego_Practice_assignment_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This coding challenge will walk you through the basics of Python 3 and Pandas library. 

Repl.it uses automatic unit tests to determine the correctness of your answer. On the left hand side you see the IDE and the console output windows. You execute your code by pressing the RUN button - you can do this as many times as you like. 

When you're ready, move on to the NEXT button to check your answers against the unit tests and submit your work for grading. Please make sure to submit your work (even if incomplete) before 8:45 PST so we can take attendance. Have fun!


Task 1: 
Your first task is to import the Pandas library, as we must install libraries (also called packages or modules) that support the functionality we need (in this case loading datasets in various formats). Remember the "iconic trio"?

Good detailed resource here: https://www.digitalocean.com/community/tutorials/how-to-import-modules-in-python-3


Task 2:
The second task is to load different file types for further processing and print out the first 5 rows. You will soon find that in data science, your datasets will come in various shapes and forms. Very frequently we use the .CSV (comma-separated values) format, however there are many others. 

Now let's test out loading and displaying a few different types in data. Load these three datasets and display the first five rows for each.

Hint: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html

Dataset 1: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv

Dataset 2: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/PeopleInSpaceNow.json

Dataset 3: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv


Stretch Goals: 
Load the Dataset 1 into a colab notebook and answer the following questions. When you are finished, add a link to your Colab notebook to the top of the code challenge as a comment.

1) Clean the data set and drop the Null/NaN values. Rename  Product_Category_1-3 columns with an actual Product. 

2) How many unique user_ids does the data set contain?

3) How many unique age brackets are in the dataset. Which Age bracket has the most entries? Which has the least?

4) Transform the Gender categorical variable into a numerical variable. Then transform that numerical value into a Boolean.

5)What is the average Occupation score? What is the Standard Deviation? What is the maximum and minimum value?

7) Group Age by Gender and print out a cross tab with age as the y axis


Super Stretch Goals: 
Build a linear regression model to predict the purchase amount given the other features in the data set with scikit learn. Try to get the best accuracy score using this metric: https://scikit-learn.org/stable/modules/generated/sklearn.metrics.accuracy_score.html

In [0]:
import pandas as pd
import numpy as np

In [0]:
!curl 'https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv'
# lotta tabs / spaces

In [3]:
black_url = 'https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv'
friday_fd = pd.read_csv(black_url)
friday_fd.dropna(subset=['Product_Category_2', 'Product_Category_3'], inplace=True)
friday_fd.rename(columns= {'Product_Category_2': 'Book', 'Product_Category_3':'Scarf', 'Product_Category_1':'Phone'}, inplace = True) 
friday_fd.head(10)

    User_ID Product_ID Gender    Age  ...  Phone  Book Scarf  Purchase
1   1000001  P00248942      F   0-17  ...      1   6.0  14.0     15200
6   1000004  P00184942      M  46-50  ...      1   8.0  17.0     19215
13  1000005  P00145042      M  26-35  ...      1   2.0   5.0     15665
14  1000006  P00231342      F  51-55  ...      5   8.0  14.0      5378
16  1000006   P0096642      F  51-55  ...      2   3.0   4.0     13055
18  1000007  P00036842      M  36-45  ...      1  14.0  16.0     11788
19  1000008  P00249542      M  26-35  ...      1   5.0  15.0     19614
24  1000008  P00303442      M  26-35  ...      1   8.0  14.0     11927
28  1000009  P00078742      M  26-35  ...      5   8.0  14.0      5391
29  1000010  P00085942      F  36-45  ...      2   4.0   8.0     16352

[10 rows x 12 columns]

In [13]:
friday_fd.describe()

            User_ID     Occupation  ...          Scarf       Purchase
count  1.642780e+05  164278.000000  ...  164278.000000  164278.000000
mean   1.003001e+06       8.180383  ...      12.669840   11661.001686
std    1.720390e+03       6.486705  ...       4.124341    5081.553550
min    1.000001e+06       0.000000  ...       3.000000     185.000000
25%    1.001497e+06       2.000000  ...       9.000000    7871.250000
50%    1.003053e+06       7.000000  ...      14.000000   11757.000000
75%    1.004418e+06      14.000000  ...      16.000000   15627.000000
max    1.006040e+06      20.000000  ...      18.000000   23959.000000

[8 rows x 7 columns]

In [4]:
in_space_url = 'https://raw.githubusercontent.com/pierretd/datasets-1/master/PeopleInSpaceNow.json'
df_space = pd.read_json(in_space_url)
df_space.head(5)

                                              people  message  number
0       {'name': 'Sergey Prokopyev', 'craft': 'ISS'}  success       3
1        {'name': 'Alexander Gerst', 'craft': 'ISS'}  success       3
2  {'name': 'Serena Aunon-Chancellor', 'craft': '...  success       3

In [5]:
fastfm_url = 'https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv'
df_fastfm = pd.read_csv(fastfm_url, sep='\t')
df_fastfm.head(5)

           #id gender   age        country    registered
0  user_000001      m   NaN          Japan  Aug 13, 2006
1  user_000002      f   NaN           Peru  Feb 24, 2006
2  user_000003      m  22.0  United States  Oct 30, 2005
3  user_000004      f   NaN            NaN  Apr 26, 2006
4  user_000005      m   NaN       Bulgaria  Jun 29, 2006

In [0]:
# friday_fd.nunique()
2. 5868
# friday_fd['Age'].mode()
3. 7, 26-35